<script setup lang="ts">
</script>

<template>
  <a class = "list-link" @click="$router.go(-1)">Назад</a>
  <div class="content">
  <section id="First_section" class="main-section">
    <header>Приготовление смеси</header>
      <p>После введения рецептуры пленки происходит подготовка сырьевой смеси. 
        Затем, посредством разгрузочных механизмов, порошкообразный поливинилхлорид, 
        модификатор ударной прочности и дисперсный наполнитель подаются из силосов в бункер
        автоматических весов, в котором происходит взвешивание сырьевых материалов. 
      </p>
      <p>После взвешивания все сыпучие компоненты поступают в двухстадийный роторный смеситель,
        состоящий из двух каскадно-установленных смесительных камер. Эти камеры предназначены
        для «холодного» и «горячего» смешения. Порошкообразный материал, поступая в смеситель
        перерабатывается в псевдоожиженном состоянии. В верхнем смесителе происходит перемешивание
        и нагрев до температуры 80°С–120°С за счет теплоты, генерируемой в результате трения частиц 
        материала друг о друга (сухого трения), и теплоты, подводимой от стенок корпуса, обогреваемого 
        минеральным маслом, циркулирующим в рубашке. По достижении заданной температуры массы регулирующая
        термопара подает сигнал на выгрузку смеси в нижний «холодный» смеситель, в котором композиция
        перемешивается и охлаждается до температуры 60°С–80°С за счет контакта со стенками корпуса, 
        охлаждаемого водой. Когда температура смеси снижается до заданного значения, готовая смесь
        выгружается через разгрузочный люк. Оба смесителя снабжены быстровращающимися смесительными
        роторами, которые обеспечивают эффективное вихреобразное перемешивание компонентов.
        «Горячий» смеситель имеет значительную частоту вращения ротора с целью увеличения
        скорости процесса смешения и, соответственно, уменьшения времени пребывания смеси 
        при высокой температуре. «Холодный» смеситель необходим для уменьшения вероятности проявления
        термической деструкции материала. В каждой из камер смешение продолжается в среднем по 8 мин.
      </p>

      <img id="film-production" src="../../public/pvc.jpg">
  </section>
  <section id="Second_section" class="main-section">
    <header>Подготовка экструдата</header>
    <p> Переработка (пластикация) полимерной композиции в экструдере
      (одношнековом, осциллирующем или двухшнековом) является важнейшим
      промежуточным звеном между подготовкой сухой смеси в двухстадийном смесителе и формованием
      пленки на каландре, поскольку полученный материал (экструдат) должен обладать свойствами, необходимыми
      для переработки на каландре. Переработка представляет собой совокупность взаимодействующих
      элементарных физических процессов, основными из которых являются:
      <ol>
        <li>предварительный разогрев смеси до температуры переработки (температуры фазового перехода полимера),
        осуществляемый за счет теплоты, генерируемой в результате пластической деформации частиц
        сыпучего материала, работы сил сухого трения, и теплоты, подводимой от обогреваемого корпуса;</li>
        <li>плавление частиц кристаллического/аморфного полимера по пробковому или дисперсному механизму за
        счет теплоты, генерируемой в результате работы сил вязкого трения в расплаве, и теплоты, подводимой от обогреваемого корпуса
        (при этом необходимо обеспечить равномерное распределение энергии в смеси – температурную однородность);</li>
        <li>диспергирование – разрушение и растирание комков и агломератов («вторичных частиц» размером (10–100)*10–6 м)
        твердых частиц полимера, красителя, дисперсного наполнителя, модификатора ударной прочности и других порошкообразных
        компонентов до элементарных частиц (глобул размером (0,6–1,0)*10–6  м) в деформируемом расплаве;</li>
        <li>перемешивание – тщательное равномерное распределение образовавшихся первичных частиц в дисперсионной фазе – расплаве полимера;</li>
        <li>нагнетание композиции в формующую головку (фильеру).</li>
      </ol>
    </p>
    <p>Для дегазации перерабатываемого полимерного материала предназначена вакуумная установка, 
        присоединяемая к вентиляционному окну в корпусе экструдера. Переработанная композиция, 
        характеризующаяся высоким уровнем материальной и температурной однородности, продавливается 
        через узел выгрузки, непосредственно присоединенный в виде головки с формующей фильерой и специальным 
        режущим устройством. Куски экструдата попадают на ленточный транспортер, над которым установлен металлоискатель, 
        осуществляющий контроль отсутствия в материале металлических включений. Если в транспортируемом материале будут обнаружены 
        металлические частицы, превышающие допустимые размеры (порядка 50*10–6 м), транспортер будет остановлен или быстро перевернут.
    </p>
    <img id="film-production" src="../../public/exstruzion.jpg">
  </section>
  <section id="Third_section" class="main-section">
    <header>Каландрование</header>
    <p>
      С транспортера с помощью качающегося (колеблющегося) ленточного транспортера прошедший проверку экструдат 
      подается непосредственно в питающий (первый межвалковый) зазор четырехвалкового L-образного каландра. 
      При этом не требуется установка дополнительных смесительных вальцов между экструдером и каландром, вследствие высокой 
      эффективности процесса переработки полимерного материала в экструдере.  Каландр работает с запасом материала в первом зазоре, 
      чтобы обеспечить отсутствие аварийной ситуации (соударение валков). Запас материала в питающем зазоре каландра при 
      установившемся режиме каландрования регулируется заданием частоты вращения шнека экструдера.
    </p>
    <p>Формование массы в полотно в виде пленки происходит при последовательном прохождении экструдата в зазорах между вращающимися 
      валками каландра. Экструдат, проходя зазор между вторым и третьим валками, развальцовывается до требуемой ширины и 
      толщины, которая обусловливается зазором между валками. На первом и втором валке каландра установлены ножи, которые, 
      вступая в контакт с поверхностным слоем полимерного материала, надрезают его и тем самым уменьшают количество воздушных 
      пузырей в пленке. На четвертом (верхнем) валке с помощью дисковых ножей производится обрезка кромок горячего материала 
      до заданной ширины. Отрезанные края пленки лентой подаются соответственно на левый и правый края питающего зазора каландра. 
    </p>
    <p>С помощью вытяжных валков горячая пленка снимается с последнего валка каландра. Съем изделия происходит за счет того, 
     что окружная скорость первого и второго съемных валков четырехвалкового вытяжного устройства больше, чем окружная скорость верхнего валка каландра. 
    </p>
    <img id="film-production" src="../../public/calander.png">
  </section>
  <section id="Fourth_section" class="main-section">
    <header>Завершающая стадия</header>
    <p>
      Снятая с каландра пленка подводится роликовым конвейером к зоне охлаждения, 
      выполненной в виде многовалковой системы. Затем охлажденная пленка проходит измерительную станцию, 
      где измеряется толщина пленки (например, с помощью радиационного толщиномера). Текущий продольный и 
      поперечный профиль толщины пленки отображается на экране компьютера (для контроля равнотолщинности пленки).
    </p>
    <p>Для визуального контроля качества поверхности пленки (соблюдение требований по цвету, наличие черных точек, 
      включений нерасплавленного полимера, желто-коричневых деструкционных полос, воздушных включений) установлена система видеоконтроля.
    </p>
    <p>После прохождения охлаждающих валков кромки пленки обрезаются с помощью круглых ножей. Обрезанные 
      кромки поступают в мельницу для грануляции (тонкого измельчения), гранулированные отходы (крошка) пневмотранспортом подают в загрузочную воронку экструдера для переработки.
      </p>
    <p>Через компенсаторное устройство, обеспечивающее временное накопление материала, выравнивание скоростей  
      отбора и сматывания пленки в рулон, пленка попадает на намоточную станцию с автоматическим узлом для отрезания 
      готовой пленки, обеспечивающую безнатяжное равномерное сматывание материала в рулоны требуемого метража.</p>
      <img id="film-production" src="../../public/polimeric-film.jpg">
  </section>
 </div>
</template>
