<script setup lang="ts">
</script>

<template>
  <a class = "list-link" @click="$router.go(-1)">Назад</a>
  <div class="content">
  <section id="First_section" class="main-section">
    <header>Расшифровка условных обозначений</header>
    <img id="film-production" src="../../public/calander-scema.png">
      <ul>
        <li><code>δ – предельная разнотолщинность пленки, м;</code></li>
        <li><code>F – вектор возмущающих воздействий;</code></li>
        <li><code>Gwast – расход потока возвратных отходов (раздробленной кромки изготовленной пленки), кг/с;</code></li>
        <li><code>Id – индекс термической деструкции экструдата, %;</code></li>
        <li><code>N – частота вращения шнека экструдера, об/с;</code></li>
        <li><code>Nh – частота вращения шнека загрузочной воронки экструдера, об/с;</code></li>
        <li><code>Sfl, Sfc – степень усадки пленки в продольном и поперечном направлении, %;</code></li>
        <li><code>Tair – температура воздуха в цехе, °С;</code></li>
        <li><code>Tbk, k = 1, …, nT – температуры nT тепловых зон корпуса экструдера, °С;</code></li>
        <li><code>Tcl, l = 1, ..., ncalend – температуры наружных поверхностей ncalend валков каландра, °С;</code></li>
        <li><code>Tclq, q = 1, ..., ncool – температуры наружных поверхностей ncool охлаждающих валков, °С;</code></li>
        <li><code>Tfilm – тип пленки;</code></li>
        <li><code>Th – температура головки (фильеры) экструдера, °С;</code></li>
        <li><code>Ttp, p = 1, ..., ntake – температуры наружных поверхностей ntake съемно-вытяжных валков, °С;</code></li>
        <li><code>U – вектор управляющих воздействий;</code></li>
        <li><code>Vcl, l = 1, ..., ncalend – окружные скорости ncalend валков каландра, м/с;</code></li>
        <li><code>Vclq, q = 1, ..., ncool – окружные скорости ncool охлаждающих валков, м/с;</code></li>
        <li><code>Vtp, p = 1, ..., ntake – окружные скорости ntake съемно-вытяжных валков, м/с;</code></li>
        <li><code>X – вектор входных параметров;</code></li>
        <li><code>Y – вектор выходных параметров;</code></li>
        <li><code>Yscalc – вектор выходных параметров s-й основной стадии производства, рассчитываемых по математическим моделям;</code></li>
        <li><code>Ysmes – вектор выходных параметров s-й основной стадии производства, измеряемых на линии;</code></li>
        <li><code>nblack, nburn, ngel, nfiber, nair, nhol, nldef – число поверхностных дефектов 
        (черных точек, желто-коричневых деструкционных полос, включений нерасплавленного полимера, волокон, воздушных пузырей,
         дырок и дефектов площадью более 15*10–6 м2) на заданной площади полотна пленки (например, на 10 м2 полотна пленки);</code></li>
        <li><code>rS – усилие контризгиба, приложенное к внешнему калибрующему валку каландра, Н;</code></li>
        <li><code>s – номер основной стадии производства (s = 1 – подготовка экструдата, s = 2 – каландрование (формование экструдата в пленку), s = 3 – съем и охлаждение пленки);</code></li>
        <li><code>x – пространственный перекос (горизонтальное смещение оси) внутреннего калибрующего валка каландра, м;</code></li>
        <li><code>Ψext – уровень (запас) экструдата в питающем зазоре, м; </code></li>
        <li><code>α – степень нагрузки на электродвигатель привода шнека экструдера, %;</code></li>
        <li><code>αcl, l = 1, ..., ncalend – степени нагрузки на электродвигатели приводов ncalend валков каландра, %;</code></li>
        <li><code>αclq, q = 1, ..., ncool – степени нагрузки на электродвигатели приводов ncool охлаждающих валков, %;</code></li>
        <li><code>αh – степень нагрузки на электродвигатель привода шнека загрузочной воронки экструдера, %;</code></li>
        <li><code>αtp, p = 1, ..., ntake – степени нагрузки на электродвигатели приводов ntake съемно-вытяжных валков, %;</code></li>
        <li><code>δf – измеряемая толщина пленки, м;</code></li>
        <li><code>δf0 – заданная толщина пленки, м;</code></li>
        <li><code>δfc – рассчитываемая толщина пленки, м; </code></li>
        <li><code>γ – степень смешения экструдата, ед. сдвига;</code></li>
        <li><code>τmleft, τmright – время работы левого и правого электродвигателей, перемещающих (поднимающих/опускающих) внешний калибрующий валок каландра, c;</code></li>
        <li><code>As – вектор настраиваемых коэффициентов математической модели для расчета выходных параметров s-й основной стадии производства, неконтролируемых на производстве;</code></li>
        <li><code>AQ – вектор коэффициентов математических моделей для оценки ключевых показателей эффективности производства;</code></li>
        <li><code>Dprod – неструктурированные данные (контролируемые параметры) производства;</code></li>
        <li><code>QPR – вектор ключевых показателей эффективности производства (производительность, энергопотребление, выход продукции);</code></li>
        <li><code>St, Rs*, Rc – описание нештатной ситуации, истинной (наиболее вероятной) причины ее возникновения и рекомендации по устранению;</code></li>
        <li><code>Us – вектор управляющих воздействий на s-й основной стадии производства;</code></li>
        <li><code>Xs – вектор входных параметров s-й основной стадии производства;</code></li>
        <li><code>{Xs, Us, Ys}, s = 1, 2, 3 – сжатые многомерные производственные данные;</code></li>
        <li><code>Ys = {Ysmes, Yscalc} – вектор выходных параметров s-й основной стадии производства;</code></li>
        <li><code>Yscalc – вектор рассчитываемых выходных параметров s-й основной стадии производства;</code></li>
        <li><code>Ysmes – вектор выходных параметров s-й основной стадии производства, измеряемых на линии;</code></li>
        <li><code>Yspred – вектор прогнозируемых выходных параметров s-й основной стадии производства.</code></li>
      </ul>
  </section>
 </div>
</template>
