<script setup lang="ts">
</script>

<template>
  <div class="content">
  <section id="First_section" class="main-section">
    <header>О программном комплексе</header>
    <p>Анализ данных на производстве – это процесс, позволяющий преобразовать данные
      с датчиков в полезную информацию, на основании которой можно делать выводы о
      качестве продукции и принимать решения, приводящие к снижению затрат на производство
      и повышению прибыли. Чтобы отслеживать показатели входных и выходных параметров на производстве полимерных плёнок,
      используются более 250 датчиков, расположенных на каждой производственной линии. 
      </p>
      <p>Информация, получаемая с этих датчиков, формирует массив данных, содержащий сотни
      тысяч строк и миллионы значений, что делает невозможным ручной анализ данных. 
      Для решения этой проблемы разрабатываются специализированные программные комплексы для интеллектуального анализа данных,
      способные производить сложные и большие расчеты с максимальной скоростью при минимальных вычислительных затратах. 
      </p>
      <p>Таким образом, актуальной задачей является разработка инновационного ИТ-проекта для
      способного хранить и анализировать результаты прогнозирований качества пленки.
      </p>
      <img id="film-production" src="../../public/film_creation.jpg">
  </section>
  <section id="Second_section" class="main-section">
    <header>Экструзионно-каландровая линия</header>
    <p>
      На рисунке предоставлена схема экструзионно-каландровой линии для получения полимерных пленок.
      Для получения расшифровки условных обозначений и процессе производства - необходимо нажать соответствующие ссылки      
    </p>
      <ul>
      <li>
        <router-link class = "list-link" to="/calanderProcess">
          Процесс производства полимерной пленки
        </router-link>
      </li>
      <li>
        <router-link class = "list-link" to="/decryption">
          Расшифровка условных обозначений
        </router-link>
      </li>
    </ul>
    <img id="film-production" src="../../public/calander-scema.png">
  </section>
  <section id="Third_section" class="main-section">
    <header>Функциональная структура и алгоритм</header>
    <p> Функциональная структура программного комплекса разделена на два интерфейса: оператора по качеству и специалиста по математическому обеспечению.</p>
    <p> Функциональная структура включает базу данных ролей, пользователей и результатов прогнозирования качества пленки моделями машинного обучения, а также она подразделена на следующие модули:</p>
    <ul>
      <li>модуль выбора параметров анализа (в данном модуле пользователь выбирает из базы данных спрогнозированные моделями данные, а также временной диапазон анализа);</li>
      <li>модуль построения графиков и таблиц (в данном модуле происходит анализ расхождений прогнозов с настоящими значениями, а также сравнение моделей машинного обучения);</li> 
      <li>модуль авторизации пользователей</li> 
      <li>модуль редактирования БД.</li> 
    </ul>
    <img id="film-production" src="../../public/functional_struct.png">       
  </section>
  <section id="Fourth_section" class="main-section">
    <header>Программные модули</header>
    <p>Программный модуль взаимодействия с БД имеет несколько классов: “PermissionManager”, “ResourceManager”, а также классы передачи данных.</p>
    <p>Класс “PermissionManager” отвечает за контроль привилегий и создает для текущего пользователя массив из “ResourceManager”, каждый из которых сконфигурирован так что бы выдавать только разрешённые ресурсы.</p>
    <p>Класс “ResourceManager” отвечает за доступ к ресурсам в зависимости от заданной конфигурации.</p>
    <p>Классы передачи данных представляют собой программное представление сущностей в базе данных и нужны для удобной работы с данными.</p>
    <p>Функции класса PermissionManager</p>
    <div class="container">
      <div class="table">
        <div class="table-header">
          <div class="header__item">Название</div>
          <div class="header__item">Тип</div>
          <div class="header__item">Описание</div>
        </div>
        <div class="table-content">	
          <div class="table-row">		
            <div class="table-data">GetResourceManagers</div>
            <div class="table-data">List&lt;ResourceManager&gt;</div>
            <div class="table-data">Возвращает массив сконфигурированных пользователей</div>
          </div>
        </div>	
      </div>
    </div>
    <p>Функции класса ResourceManager</p>
    <div class="container">
      <div class="table">
        <div class="table-header">
          <div class="header__item">Название</div>
          <div class="header__item">Тип</div>
          <div class="header__item">Описание</div>
        </div>
        <div class="table-content">	
          <div class="table-row">		
            <div class="table-data">GetObject</div>
            <div class="table-data">string</div>
            <div class="table-data">Возвращает объект из коллекции по указанному индексу. Функция доступна только если у пользователя есть права на чтение</div>
          </div>
          <div class="table-row">		
            <div class="table-data">SaveObject</div>
            <div class="table-data">string</div>
            <div class="table-data">Записывает в базу новый объект и возвращает его индекс. Функция доступна только если у пользователя есть права на запись</div>
          </div>
          <div class="table-row">		
            <div class="table-data">UpdateObject</div>
            <div class="table-data">void</div>
            <div class="table-data">Обновляет объект в базе данных по заданному индексу. Функция доступна только если у пользователя есть права на обновление</div>
          </div>
          <div class="table-row">		
            <div class="table-data">DeleteObject</div>
            <div class="table-data">void</div>
            <div class="table-data">Удаляет объект в базе данных по заданному индексу. Функция доступна только если у пользователя есть права на удаление</div>
          </div>
        </div>	
      </div>
    </div>
  </section>
  <section id="Fifth_section" class="main-section">
    <header>Тестирование программных комплексов</header>
    <p>
      В качестве метода тестирования программного комплекса было выбрано функциональное тестирование. 
      Цель функциональных тестов состоит в том, чтобы проверить каждую функцию программного приложения, предоставляя 
      соответствующий ввод, проверяя выход в соответствии с функциональными требованиями.
      Функциональное тестирование в основном включает тестирование черного ящика и не касается исходного кода приложения. 
      Это тестирование проверяет пользовательский интерфейс, базу данных, безопасность, функциональные 
      возможности тестируемого приложения. Тестирование проводится вручную.
    </p>
    <img id="film-production" src="../../public/bson.png">    
    <img id="film-production" src="../../public/predict.png">    
  </section>
 </div>
</template>
